lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VK214.svd
        <!-- #RST_REG_PER -->
        <register>
          <name>PER2_CLOCK</name>
          <description>Peripherials Clock Control 2</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <!-- #PER2_RMASK --> 
          <resetMask>0x0007FDFF</resetMask>
          <fields>
            <!-- PER2_CLOCK.SPI1_CLK_EN -->
            <field>
              <name>SPI1_CLK_EN</name>
              <description>SPI1 Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER2__SPI1_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- PER2_CLOCK.UART1_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>UART1_CLK_EN</name>
              <description>UART1 Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <!-- PER2_CLOCK.UART2_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>UART2_CLK_EN</name>
              <description>UART2 Clock Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <!-- PER2_CLOCK.EEPROM_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>EEPROM_CLK_EN</name>
              <description>EEPROM Clock Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <!-- PER2_CLOCK.RST_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>RST_CLK_EN</name>
              <description>RST Clock Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!-- #PER2_Item05 -->
            <!-- #PER2_Item06 -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>I2C_CLK_EN</name>
              <description>I2C Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <!-- #PER2_Item07 -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>LCD_CLK_EN</name>
              <description>LCD Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <!-- PER2_CLOCK.ADC_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>ADC_CLK_EN</name>
              <description>ADC Clock Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <!-- PER2_CLOCK.WWDT_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>WWDT_CLK_EN</name>
              <description>WWDT Clock Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <!-- PER2_CLOCK.IWDT_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>IWDT_CLK_EN</name>
              <description>IWDT Clock Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <!-- PER2_CLOCK.PWR_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>PWR_CLK_EN</name>
              <description>Power Clock Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <!-- PER2_CLOCK.BKP_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>BKP_CLK_EN</name>
              <description>Backup Clock Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <!-- PER2_CLOCK.ADCIU_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>ADCIU_CLK_EN</name>
              <description>ADCIU Clock Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <!-- PER2_CLOCK.TIMER1_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>TIMER1_CLK_EN</name>
              <description>TIMER1 Clock Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <!-- PER2_CLOCK.TIMER2_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>TIMER2_CLK_EN</name>
              <description>TIMER2 Clock Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <!-- PER2_CLOCK.PORTA_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>PORTA_CLK_EN</name>
              <description>GPIO PORT_A Clock Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <!-- PER2_CLOCK.PORTB_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>PORTB_CLK_EN</name>
              <description>GPIO PORT_B Clock Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <!-- PER2_CLOCK.PORTC_CLK_EN -->
            <field derivedFrom="SPI1_CLK_EN">
              <name>PORTC_CLK_EN</name>
              <description>GPIO PORT_C Clock Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <!-- #PER2_Item19 -->
            <!-- PER2_CLOCK fields end-->
          </fields>
        </register>
        <!-- #RST_REG_CAN -->
        <!-- TIM_CLOCK -->
        <register>
          <name>TIM_CLOCK</name>
          <description>Timer's Clock Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_TIM_RMASK -->
          <resetMask>0x03000707</resetMask>
          <fields>
            <!-- TIM_CLOCK.TIM1_BRG -->
            <field>
              <name>TIM1_BRG</name>
              <!-- #RST_TIM1_DESCR -->
              <description>TIM1_C2 freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM1__BRG_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>7</value></enumeratedValue>
              </enumeratedValues>              
            </field>
            <!-- TIM_CLOCK.TIM2_BRG -->
            <field derivedFrom="TIM1_BRG">
              <name>TIM2_BRG</name>
              <!-- #RST_TIM2_DESCR -->
              <description>TIM2_C2 freq divider to get TIM2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_TIM3_BRG -->
            <!-- TIM_CLOCK.TIM1_CLK_EN -->
            <field>
              <name>TIM1_CLK_EN</name>
              <description>TIM1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- TIM_CLOCK.TIM2_CLK_EN -->
            <field>
              <name>TIM2_CLK_EN</name>
              <description>TIM2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_TIM3_EN -->
            <!-- TIM_CLOCK fields end-->
          </fields>
        </register>
        <!-- UART_CLOCK-->
        <register>
          <name>UART_CLOCK</name>
          <description>UART's Clock Control</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_UART_RMASK -->
          <resetMask>0x03000707</resetMask>
          <fields>
            <!-- UART_CLOCK.UART1_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART1_BRG</name>
              <!-- #RST_UART1_DESCR -->
              <description>UART1_C2 freq divider to get UART1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- UART_CLOCK.UART2_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART2_BRG</name>
              <!-- #RST_UART2_DESCR -->
              <description>UART1_C2 freq divider to get UART2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_TIM4_BRG -->
            <!-- #RST_UART3_BRG -->
            <!-- UART_CLOCK.UART1_CLK_EN -->
            <field>
              <name>UART1_CLK_EN</name>
              <description>UART1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- UART_CLOCK.UART2_CLK_EN -->
            <field>
              <name>UART2_CLK_EN</name>
              <description>UART2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_TIM4_EN -->
            <!-- #RST_UART3_EN -->
            <!-- UART_CLOCK fields end-->
          </fields>
        </register>
        <!-- SSP_CLOCK -->
        <register>
          <name>SSP_CLOCK</name>
          <description>SSP's Clock Control</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_SSP_RMASK -->
          <resetMask>0x01000007</resetMask>
          <fields>
            <!-- SSP_CLOCK.SSP1_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP1_BRG</name>
              <!-- #RST_SSP1_DESCR -->
              <description>SSP1_C2 freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #RST_SSP2_BRG -->
            <!-- #RST_SSP3_BRG -->
            <!-- SSP_CLOCK.SSP1_CLK_EN -->
            <field>
              <name>SSP1_CLK_EN</name>
              <description>SSP1_CLOCK Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_SSP2_EN -->
            <!-- #RST_SSP3_EN -->
            <!-- SSP_CLOCK fields end-->
          </fields>
        </register>
