lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VK214.svd
        <!-- CTRL2 -->
        <register>
          <name>CTRL2</name>
          <description>ADCUI Control2 Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>SAGLVL</name>
              <description>V0 min OK level</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>SAGCYC</name>
              <description>Count of V0 half periods to calc V0 level</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <!--Fields end-->
          </fields>
        </register>
        <!-- CTRL3 -->
        <register>
          <name>CTRL3</name>
          <description>ADCUI Control3 Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>ZTXOUT</name>
              <description>V0 cross zero timeout</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <!--Fields end-->
          </fields>
        </register>
        <!-- F0CTR -->
        <register>
          <name>F0CTR</name>
          <description>FxCTR register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>I0NTEN</name>
              <description>Integrator enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="I0NTEN">
              <name>I3NTEN</name><bitRange>[1:1]</bitRange>
            </field>
            <field>        
              <name>VASEL</name>
              <description>Select source for FullEnergy  </description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>FullEnergy</name><description>I0DAT and VDAT can store FullEnergy</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>I_RMS</name><description>I0DAT and VDAT can store I_RMS</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RARS</name>
              <description>Active Energy Accumulator Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Inactive state</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Accumulator sets to zero</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RARS">
              <name>RRRS</name>
              <description>Reactive Energy Accumulator Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RARS">
              <name>RVRS</name>
              <description>Full Energy Accumulator Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VGAIN</name>
              <description>PGA value</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>x1</name><description>Signal amplification 0dB</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Signal amplification 6dB</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>Signal amplification 12dB</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>Signal amplification 18dB</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="VGAIN">
              <name>I0GAIN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>VPHASE</name>
              <description>Phase V0 adjustment by step of +-124us</description>
              <bitRange>[17:10]</bitRange>
              <access>read-write</access>
            </field>
            <field derivedFrom="VGAIN">
              <name>I3GAIN</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>IRMSOS</name>
              <description>RMS calibration of channel I</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
            <!--Fields end-->
          </fields>
        </register>
        <!-- F0WC -->
        <register>
          <name>F0WC</name>
          <description>Active energy calibration</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATTOS</name>
              <description>Calibr bias of active energy</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WGAIN</name>
              <description>Calibr gain of active energy</description>
              <bitRange>[27:16]</bitRange>
            </field>
            <!--Fields end-->
          </fields>
        </register>
        <!-- F0WATTP -->
        <register>
          <name>F0WATTP</name>
          <description>Positive Active Energy accumulator</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WATTHRP</name>
              <description>High 32 bits of Accumulator</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
