lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VK214.svd
    <!-- #LCD -->
    <!-- LCD_VK214 -->
    <peripheral>
      <name>MDR_LCD_VK214</name>
      <version>1.0</version>
      <description>LCD  Display Controler</description>
      <groupName>LCD Controller</groupName>
      <baseAddress>0x40038000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CR -->
        <register>
          <name>CR</name>
          <description>LCD Control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <!--M-->
            <field>
              <name>Mux</name>
              <description>Multiplex select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__M_</headerEnumName>
                <enumeratedValue><name>Static</name><description>Static control</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>MUX_2</name><description>Muxtiplexing 1:2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>MUX_3</name><description>Muxtiplexing 1:3</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>MUX_4</name><description>Muxtiplexing 1:4</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--B-->
            <field>
              <name>Bias</name>
              <description>Bias Modes</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__B_</headerEnumName>
                <enumeratedValue><name>div3</name><description>Bias 1/3</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>Bias 1/2</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--EN-->
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__EN_</headerEnumName>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--BF-->
            <field>
              <name>BF</name>
              <description>Flicker</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__BF_</headerEnumName>
                <enumeratedValue><name>Off</name><description>Flicker Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>2Hz</name><description>Flicker with 2 Hz</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>1Hz</name><description>Flicker with 1 Hz</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>0Hz5</name><description>Flicker with 0.5 Hz</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>        
            <!--A-->
            <field>
              <name>AltFlicker</name>
              <description>AlterFlicker</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__A_</headerEnumName>
                <enumeratedValue><name>byRegBF</name><description>Flicker according to BF</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>byAlterMemory</name><description>Flicker according to alter memory</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--VLCDON-->
            <field>
              <name>VLCDOn</name>
              <description>Select Vlcd power</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__VLCD_</headerEnumName>
                <enumeratedValue><name>Internal</name><description>Internal source</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>External</name><description>External source from pin PC2</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--DIV-->
            <field>
              <name>DIV</name>
              <description>Clock div</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
            </field>
            <!--CLK_SEL-->
            <field>
              <name>CLK_SEL</name>
              <description>Clock Select</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_LCD_CR__CLK_</headerEnumName>
                <enumeratedValue><name>LSE</name><description>Clock from LSE</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>LSI</name><description>Clock from LSI</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>  
        </register>
        <!-- ROW registers -->
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>1,2,3,4</dimIndex>
          <name>ROW%s</name>
          <description>Base memory data string</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
        </register>
        <!-- AROW registers -->
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>1,2,3,4</dimIndex>
          <name>AROW%s</name>
          <description>Alter memory data string</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>

    <!-- #UARTs -->
    <!--UART1-->
    <peripheral>
      <name>MDR_UART1</name>
      <version>1.0</version>
      <description>UART Control</description>
      <groupName>UART</groupName>
      <!-- #UART1_ADDR -->
      <baseAddress>0x40008000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--DR-->
        <register>
          <name>DR</name>
          <description>Data Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data FIFO access</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FE</name>
              <description>Stop Bit Error</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Ok</name><description>No Error</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ERROR</name><description>Error is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="FE">
              <name>PE</name>
              <description>Parity Error</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>BE</name>
              <description>Break Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>OE</name>
              <description>Overrun FIFO_RX</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <!--RSR_ECR-->
        <register>
          <name>RSR_ECR</name>
          <description>Receive Status and Error Clear Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>FE</name>
              <description>Stop Bit Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Ok</name><description>No Error</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ERROR</name><description>Error is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="FE">
              <name>PE</name>
              <description>Parity Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>BE</name>
              <description>Break Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>OE</name>
              <description>Overrun FIFO_RX</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <!--FR-->
        <register>
          <name>FR</name>
          <description>Flag Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>CTS</name>
              <description>Modem Clear To Send</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Modem line is High</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Active</name><description>Modem line is Low</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="CTS">
              <name>DSR</name>
              <description>Modem Data Set Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="CTS">
              <name>DCD</name>
              <description>Modem Data Carrier Detect</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>Transmitting data</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFE</name>
              <description>FIFO_RX Empty status</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>FIFO not Empty</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Empty</name><description>FIFO Empty</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFF</name>
              <description>FIFO_TX Full Status</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>FIFO not Full</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Full</name><description>FIFO Full</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="TXFF">
              <name>RXFF</name>
              <description>FIFO_RX Full Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RXFE">
              <name>TXFE</name>
              <description>FIFO_RX Empty status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="CTS">
              <name>RI</name>
              <description>Modem Ring Indicator</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <!--ILPR-->
        <register>
          <name>ILPR</name>
          <description>IrDA Low-Power Counter</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DVSR</name>
              <description>Div of SampleRate</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IBRD-->
        <register>
          <name>IBRD</name>
          <description>Integer BaudRate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>Baud_DivInt</name>
              <description>Integer part of Rate divisor</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
