lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VK214.svd
        <!--CH2_DTG-->
        <register  derivedFrom="CH1_DTG">
          <name>CH2_DTG</name>
          <addressOffset>0x00000044</addressOffset>
        </register>
        <!--CH3_DTG-->
        <register derivedFrom="CH1_DTG">
          <name>CH3_DTG</name>
          <addressOffset>0x00000048</addressOffset>
        </register>
        <!--CH4_DTG-->
        <register  derivedFrom="CH1_DTG">
          <name>CH4_DTG</name>
          <addressOffset>0x0000004C</addressOffset>
        </register>
        <!--BRKETR_CNTRL-->
        <register>
          <name>BRKETR_CNTRL</name>
          <description>Break and External Count Control</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BRK_INV</name>
              <description>Invert Break Signal</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Normal</name><description>Signal Not Inverted</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Invert</name><description>Signal Inverted</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="BRK_INV">
              <name>ETR_INV</name>
              <description>Invert External Count Signal</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ETR_PSC</name>
              <description>External Count Div</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>div1</name><description>No prescaler</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>Reduce freq by 2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>Reduce freq by 4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>Reduce freq by 8</description><value>3</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="MDR_TIMER1.CH1_CNTRL.CHFLTR">
              <name>ETR_Filter</name>
              <description>External Count Signal Filter</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <!--STATUS-->
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>CNT_ZERO</name>
              <description>CNT Zero</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>CNT_ARR</name>
              <description>CNT eq ARR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>ETR_RE</name>
              <description>ETR Rise Front</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>ETR_FE</name>
              <description>ETR Fall Front</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>BRK</name>
              <description>BRK High Level</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>CCR_CAP_CH1</name>
              <description>Captured to CCR</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1">
              <name>CCR_CAP_CH2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1">
              <name>CCR_CAP_CH3</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="CCR_CAP_CH1">
              <name>CCR_CAP_CH4</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>CCR_REF_CH1</name>
              <description>PWM Rise Front</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1">
              <name>CCR_REF_CH2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1">
              <name>CCR_REF_CH3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="CCR_REF_CH1">
              <name>CCR_REF_CH4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="CNT_ZERO">
              <name>CCR1_CAP_CH1</name>
              <description>Captured to CCR1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1">
              <name>CCR1_CAP_CH2</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1">
              <name>CCR1_CAP_CH3</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="CCR1_CAP_CH1">
              <name>CCR1_CAP_CH4</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
