lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VK214.svd
        <!-- CPSR -->
        <register>
          <name>CPSR</name>
          <description>Clock Prescaller Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CPSDVSR</name>
              <description>Clock Prescaller</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- IMSC -->
        <register>
          <name>IMSC</name>
          <description>IRQ Mask Set-Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>RORIM</name>
              <description>Enable IRQ on FIFO_RX overrun</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>NoEvent</name><description>Flag Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>RX_Overrun</name><description>Flag Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTIM</name>
              <description>Enable IQR on RX timeout for 32bits</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>NoEvent</name><description>Flag Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>RX_Timeout</name><description>Flag Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>RXIM</name>
              <description>Enable IQR on FIFO_RX ge 4 words</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>NoEvent</name><description>Flag Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>RX_HalfFull</name><description>Flag Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>TXIM</name>
              <description>Enable IQR on FIFO_TX le 4 words</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>NoEvent</name><description>Flag Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>TX_HalfEmpty</name><description>Flag Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <!-- #ES_Ex_IMSC -->
          </fields>
        </register>
        <!-- RIS -->
        <register>
          <name>RIS</name>
          <description>Raw Interupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field derivedFrom="MDR_SSP1.IMSC.RORIM">
              <name>RORRIS</name>
              <description>FIFO_RX is overrun</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="MDR_SSP1.IMSC.RTIM">
              <name>RTRIS</name>
              <description>RX timeout for 32bits</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="MDR_SSP1.IMSC.RXIM">
              <name>RXRIS</name>
              <description>FIFO_RX gt words</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="MDR_SSP1.IMSC.TXIM">
              <name>TXRIS</name>
              <description>FIFO_TX le words</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <!-- #ES_Ex_RIS -->
          </fields>
        </register>
        <!-- MIS -->
        <register>
          <name>MIS</name>
          <description>Masked Interupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field derivedFrom="MDR_SSP1.IMSC.RORIM">
              <name>RORMIS</name>
              <description>FIFO_RX is overrun</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="MDR_SSP1.IMSC.RTIM">
              <name>RTMIS</name>
              <description>RX timeout for 32bits</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="MDR_SSP1.IMSC.RXIM">
              <name>RXMIS</name>
              <description>FIFO_RX ge 4 words</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field derivedFrom="MDR_SSP1.IMSC.TXIM">
              <name>TXMIS</name>
              <description>FIFO_TX le 4 words</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <!-- #ES_Ex_MIS -->
          </fields>
        </register>
        <!-- ICR -->
        <register>
          <name>ICR</name>
          <description>Interupt Clear Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RORIC</name>
              <description>Clear FIFO_RX overrun flag</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear Flag</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RORIC">
              <name>RTIC</name>
              <description>Clear RX timeout flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <!-- DMACR -->
        <register>
          <name>DMACR</name>
          <description>DMA Control Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RXDMAE</name>
              <description>Enable DMA by FIFO_RX has data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Disable</name><description>Disable DMA</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enable</name><description>Enable DMA</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RXDMAE">
              <name>TXDMAE</name>
              <description>Enable DMA by FIFO_TX not Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #SSP2 -->
    <!-- #SSP3 -->
    <!-- #SSP4 -->
    <!-- #SSP5 -->
    <!-- #SSP6 -->
    <!-- #GPIOs -->
    <peripheral>
      <name>MDR_PORTA</name>
      <version>1.0</version>
      <description>GPIO Port Control</description>
      <groupName>GPIO Ports</groupName>
      <!-- #GPIO_ADDR -->
      <baseAddress>0x40080000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!-- #GPIO_SIZE -->
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- RXTX -->
        <register>
          <name>RXTX</name>
          <description>GPIO Pin Data</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_GPIO__PIN_DATA_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>LOW Level Voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>HIGH Level Voltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- OE -->
        <register>
          <name>OE</name>
          <description>Output Enable Control</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data direction</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_GPIO__PIN_DIR_</headerEnumName>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Output pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
